Revit 2027 API
BuiltInFailures.RebarFailures.NoVisibleTargetsForCurrentConstraint Property
 There are no visible constraint targets in the current view. Please switch to another view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoVisibleTargetsForCurrentConstraint { get; }
Public Shared ReadOnly Property NoVisibleTargetsForCurrentConstraint As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoVisibleTargetsForCurrentConstraint {
	FailureDefinitionId^ get ();
}
static member NoVisibleTargetsForCurrentConstraint : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace